Autodesk.Revit.DB.ExternalResourceServerExtensions
An object that contains overrides for external resource-specific methods.
Remarks:
This class permits assignment of some specific operations related to a type of
external resource, such as what to do when "Open (and Unload)" happens, or when
"Shared Coordinates update" happens for Revit links.
There is no feedback to the UI server for ExternalResourceServerExtensions.
Revit will use standard, common message dialogs to handle any error conditions.
Since:
2015